vonasmic/stm32u535-trustzone-usb/SE_firmware.ioc
USBX0.BSP.STBoard=false
USBX0.BSP.api=Unknown
USBX0.BSP.component=
USBX0.BSP.condition=SEMAOoUSBOoDRDOoFSOoDEVICEOoFOROoUSBX & DIE455
USBX0.BSP.instance=USB_DRD_FS
USBX0.BSP.ip=USB_DRD_FS
USBX0.BSP.mode=Device_Only_FS
USBX0.BSP.name=USB_Device
USBX0.BSP.semaphore=
USBX0.BSP.solution=USB_DRD_FS
VP_GTZC_S_VS_GTZC_Enable.Mode=GTZC_Enable
VP_GTZC_S_VS_GTZC_Enable.Signal=GTZC_S_VS_GTZC_Enable
VP_ICACHE_VS_SECURE_ICACHE_REG.Mode=ICACHE_REG_Not_Secured
VP_ICACHE_VS_SECURE_ICACHE_REG.Signal=ICACHE_VS_SECURE_ICACHE_REG
VP_LPBAMQUEUE_VS_QUEUE.Mode=QUEUEMODE
VP_LPBAMQUEUE_VS_QUEUE.Signal=LPBAMQUEUE_VS_QUEUE
VP_LPBAM_VS_SIG1.Mode=SmartRun
VP_LPBAM_VS_SIG1.Signal=LPBAM_VS_SIG1
VP_LPBAM_VS_SIG4.Mode=LPDMA1
VP_LPBAM_VS_SIG4.Signal=LPBAM_VS_SIG4
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_PWR_VS_SECSignals.Mode=Security/Privilege
VP_PWR_VS_SECSignals.Signal=PWR_VS_SECSignals
VP_RCC_USB.Mode=CRS SYNC Source USB
VP_RCC_USB.Signal=RCC_USB
VP_RNG_VS_RNG.Mode=RNG_Activate
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_SAU_VS_SAU.Mode=SAU_Init
VP_SAU_VS_SAU.Signal=SAU_VS_SAU
VP_SYS_S_VS_Systick.Mode=SysTick
VP_SYS_S_VS_Systick.Signal=SYS_S_VS_Systick
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_USBX_Core_System.Mode=Core_System
VP_USBX_Core_System.Signal=USBX_Core_System
VP_USBX_UX\ Device\ CDC\ ACM\ Class_FS.Mode=UX_Device_class_CDC_ACM_FS
VP_USBX_UX\ Device\ CDC\ ACM\ Class_FS.Signal=USBX_UX Device CDC ACM Class_FS
VP_USBX_UX\ Device\ Controller_FS.Mode=UX_Device_Controller_FS
VP_USBX_UX\ Device\ Controller_FS.Signal=USBX_UX Device Controller_FS
VP_USBX_UX\ Device\ CoreStack_FS.Mode=UX_Device_CoreStack_FS
VP_USBX_UX\ Device\ CoreStack_FS.Signal=USBX_UX Device CoreStack_FS
VP_wolfSSL.I-CUBE-wolfSSL_M33S_VS_wolfSSLJjwolfSSL_5.9.2_5.9.2.Mode=wolfSSLJjwolfSSL
VP_wolfSSL.I-CUBE-wolfSSL_M33S_VS_wolfSSLJjwolfSSL_5.9.2_5.9.2.Signal=wolfSSL.I-CUBE-wolfSSL_M33S_VS_wolfSSLJjwolfSSL_5.9.2_5.9.2
board=custom
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.IPParameters=WOLF_CONF_MATH,WOLF_CONF_TLS12,WOLF_CONF_DH,WOLF_CONF_SHA2_256,WOLF_CONF_SHA2_384,WOLF_CONF_KYBER,WOLF_CONF_CHAPOLY,WOLF_CONF_SHA3,wolfSSLCcwolfSSLJjwolfSSLJjCore,wolfSSLCcwolfSSLJjwolfCryptJjCore,WOLF_CONF_TEST,WOLF_CONF_WOLFCRYPT_ONLY
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_CHAPOLY=0
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_DH=0
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_KYBER=1
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_MATH=4
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_SHA2_256=1
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_SHA2_384=1
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_SHA3=1
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_TEST=0
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_TLS12=0
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.WOLF_CONF_WOLFCRYPT_ONLY=0
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.wolfSSLCcwolfSSLJjwolfCryptJjCore=true
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.wolfSSLCcwolfSSLJjwolfSSLJjCore=true
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S.wolfSSLJjwolfSSL_Checked=true
wolfSSL.I-CUBE-wolfSSL.5.9.2_M33S_SwParameter=wolfSSLCcwolfSSLJjwolfCryptJjCore\:true;wolfSSLCcwolfSSLJjwolfSSLJjCore\:true;
